apache/nuttx/arch/arm/src/xmc4/chip/xmc4_usic.h
#define USIC_INPR_TSINP_SHIFT       (0)       /* Bits 0-2: Transmit Shift Interrupt Node Pointer */
#define USIC_INPR_TSINP_MASK        (7 << USIC_INPR_TSINP_SHIFT)
#  define USIC_INPR_TSINP_SR0       (0 << USIC_INPR_TSINP_SHIFT) /* Output SR0 activated */
#  define USIC_INPR_TSINP_SR1       (1 << USIC_INPR_TSINP_SHIFT) /* Output SR1 activated */
#  define USIC_INPR_TSINP_SR2       (2 << USIC_INPR_TSINP_SHIFT) /* Output SR2 activated */
#  define USIC_INPR_TSINP_SR3       (3 << USIC_INPR_TSINP_SHIFT) /* Output SR3 activated */
#  define USIC_INPR_TSINP_SR4       (4 << USIC_INPR_TSINP_SHIFT) /* Output SR4 activated */
#  define USIC_INPR_TSINP_SR5       (5 << USIC_INPR_TSINP_SHIFT) /* Output SR5 activated */
#define USIC_INPR_TBINP_SHIFT       (4)       /* Bits 4-6: Transmit Buffer Interrupt Node Poi */
#define USIC_INPR_TBINP_MASK        (7 << USIC_INPR_TBINP_SHIFT)
#  define USIC_INPR_TBINP_SR0       (0 << USIC_INPR_TBINP_SHIFT) /* Output SR0 activated */
#  define USIC_INPR_TBINP_SR1       (1 << USIC_INPR_TBINP_SHIFT) /* Output SR1 activated */
#  define USIC_INPR_TBINP_SR2       (2 << USIC_INPR_TBINP_SHIFT) /* Output SR2 activated */
#  define USIC_INPR_TBINP_SR3       (3 << USIC_INPR_TBINP_SHIFT) /* Output SR3 activated */
#  define USIC_INPR_TBINP_SR4       (4 << USIC_INPR_TBINP_SHIFT) /* Output SR4 activated */
#  define USIC_INPR_TBINP_SR5       (5 << USIC_INPR_TBINP_SHIFT) /* Output SR5 activated */
#define USIC_INPR_RINP_SHIFT        (8)       /* Bits 8-10: Receive Interrupt Node Pointer */
#define USIC_INPR_RINP_MASK         (7 << USIC_INPR_RINP_SHIFT)
#  define USIC_INPR_RINP_SR0        (0 << USIC_INPR_RINP_SHIFT) /* Output SR0 activated */
#  define USIC_INPR_RINP_SR1        (1 << USIC_INPR_RINP_SHIFT) /* Output SR1 activated */
#  define USIC_INPR_RINP_SR2        (2 << USIC_INPR_RINP_SHIFT) /* Output SR2 activated */
#  define USIC_INPR_RINP_SR3        (3 << USIC_INPR_RINP_SHIFT) /* Output SR3 activated */
#  define USIC_INPR_RINP_SR4        (4 << USIC_INPR_RINP_SHIFT) /* Output SR4 activated */
#  define USIC_INPR_RINP_SR5        (5 << USIC_INPR_RINP_SHIFT) /* Output SR5 activated */
#define USIC_INPR_AINP_SHIFT        (12)      /* Bits 12-14: Alternative Receive Interrupt Node Pointer */
#define USIC_INPR_AINP_MASK         (7 << USIC_INPR_AINP_SHIFT)
#  define USIC_INPR_AINP_SR0        (0 << USIC_INPR_AINP_SHIFT) /* Output SR0 activated */
#  define USIC_INPR_AINP_SR1        (1 << USIC_INPR_AINP_SHIFT) /* Output SR1 activated */
#  define USIC_INPR_AINP_SR2        (2 << USIC_INPR_AINP_SHIFT) /* Output SR2 activated */
#  define USIC_INPR_AINP_SR3        (3 << USIC_INPR_AINP_SHIFT) /* Output SR3 activated */
#  define USIC_INPR_AINP_SR4        (4 << USIC_INPR_AINP_SHIFT) /* Output SR4 activated */
#  define USIC_INPR_AINP_SR5        (5 << USIC_INPR_AINP_SHIFT) /* Output SR5 activated */
#define USIC_INPR_PINP_SHIFT        (16)      /* Bits 16-18: Protocol Interrupt Node Pointer */
#define USIC_INPR_PINP_MASK         (7 << USIC_INPR_PINP_SHIFT)
#  define USIC_INPR_PINP_SR0        (0 << USIC_INPR_PINP_SHIFT) /* Output SR0 activated */
#  define USIC_INPR_PINP_SR1        (1 << USIC_INPR_PINP_SHIFT) /* Output SR1 activated */
#  define USIC_INPR_PINP_SR2        (2 << USIC_INPR_PINP_SHIFT) /* Output SR2 activated */
#  define USIC_INPR_PINP_SR3        (3 << USIC_INPR_PINP_SHIFT) /* Output SR3 activated */
#  define USIC_INPR_PINP_SR4        (4 << USIC_INPR_PINP_SHIFT) /* Output SR4 activated */
#  define USIC_INPR_PINP_SR5        (5 << USIC_INPR_PINP_SHIFT) /* Output SR5 activated */

/* Input Control Register 0, Input Control Register 1, Input Control Register 2,
 * Input Control Register 3, Input Control Register 4, Input Control Register 5
 */

#define USIC_DXCR_DSEL_SHIFT        (0)      /* Bits 0-2: Data Selection for Input Signal */
#define USIC_DXCR_DSEL_MASK         (7 << USIC_DX0CR_DSEL_SHIFT)
#  define USIC_DXCR_DSEL_DXA        (0 << USIC_DX0CR_DSEL_SHIFT) /* Data input DXnA selected */
#  define USIC_DXCR_DSEL_DXB        (1 << USIC_DX0CR_DSEL_SHIFT) /* Data input DXnB selected */
#  define USIC_DXCR_DSEL_DXC        (2 << USIC_DX0CR_DSEL_SHIFT) /* Data input DXnC selected */
#  define USIC_DXCR_DSEL_DXD        (3 << USIC_DX0CR_DSEL_SHIFT) /* Data input DXnD selected */
#  define USIC_DXCR_DSEL_DXE        (4 << USIC_DX0CR_DSEL_SHIFT) /* Data input DXnE selected */
#  define USIC_DXCR_DSEL_DXF        (5 << USIC_DX0CR_DSEL_SHIFT) /* Data input DXnF selected */
#  define USIC_DXCR_DSEL_DXG        (6 << USIC_DX0CR_DSEL_SHIFT) /* Data input DXnG selected */
#  define USIC_DXCR_DSEL_ONE        (7 << USIC_DX0CR_DSEL_SHIFT) /* Data input is always 1 */
#define USIC_DX1CR_DCEN             (1 << 3)  /* Bit 3:  Delay Compensation Enable (DX1CR only) */
#define USIC_DXCR_INSW              (1 << 4)  /* Bit 4:  Input Switch */
#define USIC_DXCR_DFEN              (1 << 5)  /* Bit 5:  Digital Filter Enable */
#define USIC_DXCR_DSEN              (1 << 6)  /* Bit 6:  Data Synchronization Enable */
#define USIC_DXCR_DPOL              (1 << 8)  /* Bit 8:  Data Polarity for DXn */
#define USIC_DXCR_SFSEL             (1 << 9)  /* Bit 9:  Sampling Frequency Selection */
#define USIC_DXCR_CM_SHIFT          (10)      /* Bits 10-11: Combination Mode */
#define USIC_DXCR_CM_MASK           (3 << USIC_DX0CR_CM_SHIFT)
#  define USIC_DXCR_CM_DISABLE      (0 << USIC_DX0CR_CM_SHIFT) /* Trigger activation disabled */
#  define USIC_DXCR_CM_RISING       (1 << USIC_DX0CR_CM_SHIFT) /* Rising edge activates DXnT */
#  define USIC_DXCR_CM_FALLING      (2 << USIC_DX0CR_CM_SHIFT) /* Falling edge activates DXnT */
#  define USIC_DXCR_CM_BOTH         (3 << USIC_DX0CR_CM_SHIFT) /* Both edges activate DXnT */
#define USIC_DXCR_DXS               (1 << 15) /* Bit 15:  Synchronized Data Value */

/* Shift Control Register */

#define USIC_SCTR_SDIR              (1 << 0)  /* Bit 0:  Shift Direction */
#define USIC_SCTR_PDL               (1 << 1)  /* Bit 1:  Passive Data Level */
#define USIC_SCTR_DSM_SHIFT         (2)       /* Bits 2-3: Data Shift Mode */
#define USIC_SCTR_DSM_MASK          (3 << USIC_SCTR_DSM_SHIFT)
#  define USIC_SCTR_DSM_1BIT        (0 << USIC_SCTR_DSM_SHIFT) /* Data is shifted one bit at a time */
#  define USIC_SCTR_DSM_2BITS       (2 << USIC_SCTR_DSM_SHIFT) /* Data is shifted two bits at a time */
#  define USIC_SCTR_DSM_4BITS       (3 << USIC_SCTR_DSM_SHIFT) /* Data is shifted four bits at a time */
#define USIC_SCTR_HPCDIR            (1 << 4)  /* Bit 4:  Port Control Direction */
#define USIC_SCTR_DOCFG_SHIFT       (6)       /* Bits 6-7: Data Output Configuration */
#define USIC_SCTR_DOCFG_MASK        (3 << USIC_SCTR_DOCFG_SHIFT)
  #define USIC_SCTR_DOCFG_SHIFT     (0 << USIC_SCTR_DOCFG_SHIFT) /* DOUTx = shift data value */
  #define USIC_SCTR_DOCFG_INVERT    (1 << USIC_SCTR_DOCFG_SHIFT) /* DOUTx = inverted shift data value */
#define USIC_SCTR_TRM_SHIFT         (8)       /* Bits 8-9: Transmission Mode */
#define USIC_SCTR_TRM_MASK          (3 << USIC_SCTR_TRM_SHIFT)
#  define USIC_SCTR_TRM_INACTIVE    (0 << USIC_SCTR_TRM_SHIFT) /* Inactive */
#  define USIC_SCTR_TRM_0LEVEL      (1 << USIC_SCTR_TRM_SHIFT) /* Active at 1-level */
#  define USIC_SCTR_TRM_1LEVEL      (2 << USIC_SCTR_TRM_SHIFT) /* Active if it is at 0-level */
#  define USIC_SCTR_TRM_ACTIVE      (3 << USIC_SCTR_TRM_SHIFT) /* Active without regard to signal level */
#define USIC_SCTR_FLE_SHIFT         (16)      /* Bits 16-21: Frame Length */
#define USIC_SCTR_FLE_MASK          (0x3f << USIC_SCTR_FLE_SHIFT)
#  define USIC_SCTR_FLE(n)          ((uint32_t)(n) << USIC_SCTR_FLE_SHIFT)
#define USIC_SCTR_WLE_SHIFT         (24)      /* Bits 24-27: Word Length */
#define USIC_SCTR_WLE_MASK          (15 << USIC_SCTR_WLE_SHIFT)
#  define USIC_SCTR_WLE(n)          ((uint32_t)((n)-1) << USIC_SCTR_WLE_SHIFT)

/* Transmit Control/Status Register */

