apache/nuttx/arch/arm/src/xmc4/chip/xmc4_usic.h
#define USIC_TCSR_WLEMD             (1 << 0)  /* Bit 0:  WLE Mode */
#define USIC_TCSR_SELMD             (1 << 1)  /* Bit 1:  Select Mode */
#define USIC_TCSR_FLEMD             (1 << 2)  /* Bit 2:  FLE Mode */
#define USIC_TCSR_WAMD              (1 << 3)  /* Bit 3:  WA Mode */
#define USIC_TCSR_HPCMD             (1 << 4)  /* Bit 4:  Hardware Port Control Mode */
#define USIC_TCSR_SOF               (1 << 5)  /* Bit 5:  Start Of Frame */
#define USIC_TCSR_EOF               (1 << 6)  /* Bit 6:  End Of Frame */
#define USIC_TCSR_TDV               (1 << 7)  /* Bit 7:  Transmit Data Valid */
#define USIC_TCSR_TDSSM             (1 << 8)  /* Bit 8:  TBUF Data Single Shot Mode */
#define USIC_TCSR_TDEN_SHIFT        (10)      /* Bits 10-11: TBUF Data Enable */
#define USIC_TCSR_TDEN_MASK         (3 << USIC_TCSR_TDEN_SHIFT)
#  define USIC_TCSR_TDEN_DISABLE    (0 << USIC_TCSR_TDEN_SHIFT) /* Transmission of data word disabled */
#  define USIC_TCSR_TDEN_TDIV       (1 << USIC_TCSR_TDEN_SHIFT) /* Transmission of data word if TDV = 1 */
#  define USIC_TCSR_TDEN_TDIVDX2S0  (2 << USIC_TCSR_TDEN_SHIFT) /* Transmission of data word if TDV = 1 while DX2S = 0 */
#  define USIC_TCSR_TDEN_TDIVDX2S1  (3 << USIC_TCSR_TDEN_SHIFT) /* Transmission of data word if TDV = 1 while DX2S = 1 */
#define USIC_TCSR_TDVTR             (1 << 12) /* Bit 12: TBUF Data Valid Trigger */
#define USIC_TCSR_WA                (1 << 13) /* Bit 13: Word Addre */
#define USIC_TCSR_TSOF              (1 << 24) /* Bit 24: Transmitted Start Of Frame */
#define USIC_TCSR_TV                (1 << 26) /* Bit 26: Transmission Valid */
#define USIC_TCSR_TVC               (1 << 27) /* Bit 27: Transmission Valid Cumulated */
#define USIC_TCSR_TE                (1 << 28) /* Bit 28: Trigger Event */

/* Protocol Control Register */

#define USIC_PCR_CTR(n)             (1 << (n))/* Bit n:  Protocol Control Bit n */
#define USIC_PCR_CTR0               (1 << 0)  /* Bit 0:  Protocol Control Bit 0 */
#define USIC_PCR_CTR1               (1 << 1)  /* Bit 1:  Protocol Control Bit 1 */
#define USIC_PCR_CTR2               (1 << 2)  /* Bit 2:  Protocol Control Bit 2 */
#define USIC_PCR_CTR3               (1 << 3)  /* Bit 3:  Protocol Control Bit 3 */
#define USIC_PCR_CTR4               (1 << 4)  /* Bit 4:  Protocol Control Bit 4 */
#define USIC_PCR_CTR5               (1 << 5)  /* Bit 5:  Protocol Control Bit 5 */
#define USIC_PCR_CTR6               (1 << 6)  /* Bit 6:  Protocol Control Bit 6 */
#define USIC_PCR_CTR7               (1 << 7)  /* Bit 7:  Protocol Control Bit 7 */
#define USIC_PCR_CTR8               (1 << 8)  /* Bit 8:  Protocol Control Bit 8 */
#define USIC_PCR_CTR9               (1 << 9)  /* Bit 9:  Protocol Control Bit 9 */
#define USIC_PCR_CTR10              (1 << 10) /* Bit 10: Protocol Control Bit 10 */
#define USIC_PCR_CTR11              (1 << 11) /* Bit 11: Protocol Control Bit 11 */
#define USIC_PCR_CTR12              (1 << 12) /* Bit 12: Protocol Control Bit 12 */
#define USIC_PCR_CTR13              (1 << 13) /* Bit 13: Protocol Control Bit 13 */
#define USIC_PCR_CTR14              (1 << 14) /* Bit 14: Protocol Control Bit 14 */
#define USIC_PCR_CTR15              (1 << 15) /* Bit 15: Protocol Control Bit 15 */
#define USIC_PCR_CTR16              (1 << 16) /* Bit 16: Protocol Control Bit 16 */
#define USIC_PCR_CTR17              (1 << 17) /* Bit 17: Protocol Control Bit 17 */
#define USIC_PCR_CTR18              (1 << 18) /* Bit 18: Protocol Control Bit 18 */
#define USIC_PCR_CTR19              (1 << 19) /* Bit 19: Protocol Control Bit 19 */
#define USIC_PCR_CTR20              (1 << 20) /* Bit 20: Protocol Control Bit 20 */
#define USIC_PCR_CTR21              (1 << 21) /* Bit 21: Protocol Control Bit 21 */
#define USIC_PCR_CTR22              (1 << 22) /* Bit 22: Protocol Control Bit 22 */
#define USIC_PCR_CTR23              (1 << 23) /* Bit 23: Protocol Control Bit 23 */
#define USIC_PCR_CTR24              (1 << 24) /* Bit 24: Protocol Control Bit 24 */
#define USIC_PCR_CTR25              (1 << 25) /* Bit 25: Protocol Control Bit 25 */
#define USIC_PCR_CTR26              (1 << 26) /* Bit 26: Protocol Control Bit 26 */
#define USIC_PCR_CTR27              (1 << 27) /* Bit 27: Protocol Control Bit 27 */
#define USIC_PCR_CTR28              (1 << 28) /* Bit 28: Protocol Control Bit 28 */
#define USIC_PCR_CTR29              (1 << 29) /* Bit 29: Protocol Control Bit 29 */
#define USIC_PCR_CTR30              (1 << 30) /* Bit 30: Protocol Control Bit 30 */
#define USIC_PCR_CTR31              (1 << 31) /* Bit 31: Protocol Control Bit 31 */

#define USIC_PCR_ASCMODE_SMD        (1 << 0)  /* Bit 0:  Sample Mode */
#define USIC_PCR_ASCMODE_STPB       (1 << 1)  /* Bit 1:  Stop Bits */
#define USIC_PCR_ASCMODE_IDM        (1 << 2)  /* Bit 2:  Idle Detection Mode */
#define USIC_PCR_ASCMODE_SBIEN      (1 << 3)  /* Bit 3:  Synchronization Break Interrupt Enable */
#define USIC_PCR_ASCMODE_CDEN       (1 << 4)  /* Bit 4:  Collision Detection Enable */
#define USIC_PCR_ASCMODE_RNIEN      (1 << 5)  /* Bit 5:  Receiver Noise Detection Interrupt Enable */
#define USIC_PCR_ASCMODE_FEIEN      (1 << 6)  /* Bit 6:  Format Error Interrupt Enable */
#define USIC_PCR_ASCMODE_FFIEN      (1 << 7)  /* Bit 7:  Frame Finished Interrupt Enable */
#define USIC_PCR_ASCMODE_SP_SHIFT   (8)       /* Bits 8-12: Sample Point */
#define USIC_PCR_ASCMODE_SP_MASK    (31 << USIC_PCR_ASCMODE_SP_SHIFT)
#  define USIC_PCR_ASCMODE_SP(n)    ((uint32_t)(n) << USIC_PCR_ASCMODE_SP_SHIFT)
#define USIC_PCR_ASCMODE_PL_SHIFT   (13)      /* Bits 13-15: Pulse Length */
#define USIC_PCR_ASCMODE_PL_MASK    (7 << USIC_PCR_ASCMODE_PL_SHIFT)
  #define USIC_PCR_ASCMODE_PL(n)    ((uint32_t)((n)-1) << USIC_PCR_ASCMODE_PL_SHIFT)
#define USIC_PCR_ASCMODE_RSTEN      (1 << 16) /* Bit 16: Receiver Status Enable */
#define USIC_PCR_ASCMODE_TSTEN      (1 << 17) /* Bit 17: Transmitter Status Enable */
#define USIC_PCR_ASCMODE_MCLK       (1 << 31) /* Bit 31: Master Clock Enable */

#define USIC_PCR_SSCMODE_MSLSEN     (1 << 0)  /* Bit 0:  MSLS Enable */
#define USIC_PCR_SSCMODE_SELCTR     (1 << 1)  /* Bit 1:  Select Control */
#define USIC_PCR_SSCMODE_SELINV     (1 << 2)  /* Bit 2:  Select Inversion */
#define USIC_PCR_SSCMODE_FEM        (1 << 3)  /* Bit 3:  Frame End Mode */
#define USIC_PCR_SSCMODE_CTQSEL1_SHIFT   (4)  /* Bits 4-5: Input Frequency Selection */
#define USIC_PCR_SSCMODE_CTQSEL1_MASK    (3 << USIC_PCR_SSCMODE_CTQSEL1_SHIFT)
#  define USIC_PCR_SSCMODE_CTQSEL1_FPDIV (0 << USIC_PCR_SSCMODE_CTQSEL1_SHIFT) /* fCTQIN = fPDIV */
#  define USIC_PCR_SSCMODE_CTQSEL1_FPPP  (1 << USIC_PCR_SSCMODE_CTQSEL1_SHIFT) /* fCTQIN = fPPP */
#  define USIC_PCR_SSCMODE_CTQSEL1_FSCLK (2 << USIC_PCR_SSCMODE_CTQSEL1_SHIFT) /* fCTQIN = fSCLK */
#  define USIC_PCR_SSCMODE_CTQSEL1_FMCLK (3 << USIC_PCR_SSCMODE_CTQSEL1_SHIFT) /* fCTQIN = fMCLK */
#define USIC_PCR_SSCMODE_PCTQ1_SHIFT   (6)    /* Bits 6-7: Divider Factor PCTQ1 for Tiw and Tnf */
#define USIC_PCR_SSCMODE_PCTQ1_MASK    (3 << USIC_PCR_SSCMODE_PCTQ1_SHIFT)
#  define USIC_PCR_SSCMODE_PCTQ1(n)    ((uint32_t)((n)-1) << USIC_PCR_SSCMODE_PCTQ1_SHIFT)
#define USIC_PCR_SSCMODE_DCTQ1_SHIFT   (8)    /* Bits 8-12: Divider Factor DCTQ1 for Tiw and Tnf */
#  define USIC_PCR_SSCMODE_DCTQ1(n)    (0x1f << USIC_PCR_SSCMODE_DCTQ1_SHIFT)
#define USIC_PCR_SSCMODE_DCTQ1_MASK    ((uint32_t)((n)-1) << USIC_PCR_SSCMODE_DCTQ1_SHIFT)
#define USIC_PCR_SSCMODE_PARIEN     (1 << 13) /* Bit 13: Parity Error Interrupt Enable */
#define USIC_PCR_SSCMODE_MSLSIEN    (1 << 14) /* Bit 14: MSLS Interrupt Enable */
#define USIC_PCR_SSCMODE_DX2TIEN    (1 << 15) /* Bit 15: DX2T Interrupt Enable */
#define USIC_PCR_SSCMODE_SELO_SHIFT (16)      /* Bits 16-23: Select Output */
#define USIC_PCR_SSCMODE_SELO_MASK  (0xff << USIC_PCR_SSCMODE_SELO_SHIFT)
#  define USIC_PCR_SSCMODE_SELO(n)  (1 << ((n) + USIC_PCR_SSCMODE_SELO_SHIFT))
#define USIC_PCR_SSCMODE_TIWEN      (1 << 24) /* Bit 24: Enable Inter-Word Delay Tiw */
#define USIC_PCR_SSCMODE_SLPHSEL    (1 << 25) /* Bit 25: Slave Mode Clock Phase Select */
#define USIC_PCR_SSCMODE_MCLK       (1 << 31) /* Bit 31: Master Clock Enable */

