apache/nuttx/arch/arm/src/xmc4/chip/xmc4_usic.h
#define USIC_PCR_IICMODE_SLAD_SHIFT (0)       /* Bits 0-15: Slave Address */
#define USIC_PCR_IICMODE_SLAD_MASK  (0xffff << USIC_PCR_IICMODE_SLAD_SHIFT)
#  define USIC_PCR_IICMODE_SLAD(n)  ((uint32_t)(n) << USIC_PCR_IICMODE_SLAD_SHIFT)
#define USIC_PCR_IICMODE_ACK00      (1 << 16) /* Bit 16: Acknowledge 00H */
#define USIC_PCR_IICMODE_STIM       (1 << 17) /* Bit 17: Symbol Timing */
#define USIC_PCR_IICMODE_SCRIEN     (1 << 18) /* Bit 18: Start Condition Received Interrupt Enable */
#define USIC_PCR_IICMODE_RSCRIEN    (1 << 19) /* Bit 19: Repeated Start Condition Received Interrupt */
#define USIC_PCR_IICMODE_PCRIEN     (1 << 20) /* Bit 20: Stop Condition Received Interrupt Enable */
#define USIC_PCR_IICMODE_NACKIEN    (1 << 21) /* Bit 21: Non-Acknowledge Interrupt Enable */
#define USIC_PCR_IICMODE_ARLIEN     (1 << 22) /* Bit 22: Arbitration Lost Interrupt Enable */
#define USIC_PCR_IICMODE_SRRIEN     (1 << 23) /* Bit 23: Slave Read Request Interrupt Enable */
#define USIC_PCR_IICMODE_ERRIEN     (1 << 24) /* Bit 24: Error Interrupt Enable */
#define USIC_PCR_IICMODE_SACKDIS    (1 << 25) /* Bit 25: Slave Acknowledge Disable */
#define USIC_PCR_IICMODE_HDEL_SHIFT (26)      /* Bits 26-29: Hardware Delay */
#define USIC_PCR_IICMODE_HDEL_MASK  (15 << USIC_PCR_IICMODE_HDEL_SHIFT)
#  define USIC_PCR_IICMODE_HDEL(n)  ((uint32_t)(n) << USIC_PCR_IICMODE_HDEL_SHIFT)
#define USIC_PCR_IICMODE_ACKIEN     (1 << 30) /* Bit 30: Acknowledge Interrupt Enable */
#define USIC_PCR_IICMODE_MCLK       (1 << 31) /* Bit 31: Master Clock Enable */

#define USIC_PCR_IISMODE_WAGEN      (1 << 0)  /* Bit 0:  WA Generation Enable */
#define USIC_PCR_IISMODE_DTEN       (1 << 1)  /* Bit 1:  Data Transfers Enable */
#define USIC_PCR_IISMODE_SELINV     (1 << 2)  /* Bit 2:  Select Inversion */
#define USIC_PCR_IISMODE_WAFEIEN    (1 << 4)  /* Bit 4:  WA Falling Edge Interrupt Enable */
#define USIC_PCR_IISMODE_WAREIEN    (1 << 5)  /* Bit 5:  WA Rising Edge Interrupt Enable */
#define USIC_PCR_IISMODE_ENDIEN     (1 << 6)  /* Bit 6:  END Interrupt Enable */
#define USIC_PCR_IISMODE_DX2TIEN    (1 << 15) /* Bit 15: DX2T Interrupt Enable */
#define USIC_PCR_IISMODE_TDEL_SHIFT (16)      /* Bits 16-21: Transfer Delay */
#define USIC_PCR_IISMODE_TDEL_MASK  (0x3f << USIC_PCR_IISMODE_TDEL_SHIFT)
#  define USIC_PCR_IISMODE_TDEL(n)  ((uint32_t)(n) << USIC_PCR_IISMODE_TDEL_SHIFT)
#define USIC_PCR_IISMODE_MCLK       (1 << 31) /* Bit 31: Master Clock Enable */

/* Channel Control Register */

#define USIC_CCR_MODE_SHIFT         (0)       /* Bits 0-3:  Operating Mode */
#define USIC_CCR_MODE_MASK          (15 << USIC_CCR_MODE_SHIFT)
#  define USIC_CCR_MODE_DISABLE     (0 << USIC_CCR_MODE_SHIFT) /* USIC channel is disabled */
#  define USIC_CCR_MODE_SPI         (1 << USIC_CCR_MODE_SHIFT) /* SSC (SPI) protocol is selected */
#  define USIC_CCR_MODE_ASC         (2 << USIC_CCR_MODE_SHIFT) /* ASC (SCI, UART) protocol is selected */
#  define USIC_CCR_MODE_I2S         (3 << USIC_CCR_MODE_SHIFT) /* IIS protocol is selected */
#  define USIC_CCR_MODE_I2C         (4 << USIC_CCR_MODE_SHIFT) /* IIC protocol is selected */
#define USIC_CCR_HPCEN_SHIFT        (6)       /* Bits 6-7: Hardware Port Control Enable */
#define USIC_CCR_HPCEN_MASK         (3 << USIC_CCR_HPCEN_SHIFT)
#  define USIC_CCR_HPCEN_DISABLE    (0 << USIC_CCR_HPCEN_SHIFT) /* Port control disabled */
#  define USIC_CCR_HPCEN_DX0_1      (1 << USIC_CCR_HPCEN_SHIFT) /* Port control enabled for DX0 and DOUT0 */
#  define USIC_CCR_HPCEN_DX3        (2 << USIC_CCR_HPCEN_SHIFT) /* Port control enabled for DX3, DX0 and DOUT[1:0] */
#  define USIC_CCR_HPCEN_DX0_2      (3 << USIC_CCR_HPCEN_SHIFT) /* Port control enabled for DX0, DX[5:3] and DOUT[3:0] */
#define USIC_CCR_PM_SHIFT           (8)       /* Bits 8-9: Parity Mode */
#define USIC_CCR_PM_MASK            (3 << USIC_CCR_PM_SHIFT)
#  define USIC_CCR_PM_ DISABLE      (0 << USIC_CCR_PM_SHIFT) /* Parity generation is disabled */
#  define USIC_CCR_PM_ EVEN         (2 << USIC_CCR_PM_SHIFT) /* Even parity is selected */
#  define USIC_CCR_PM_ ODD          (3 << USIC_CCR_PM_SHIFT) /* Odd parity is selected */
#define USIC_CCR_RSIEN              (1 << 10) /* Bit 10: Receiver Start Interrupt Enable */
#define USIC_CCR_DLIEN              (1 << 11) /* Bit 11: Data Lost Interrupt Enable */
#define USIC_CCR_TSIEN              (1 << 12) /* Bit 12: Transmit Shift Interrupt Enable */
#define USIC_CCR_TBIEN              (1 << 13) /* Bit 13: Transmit Buffer Interrupt Enable */
#define USIC_CCR_RIEN               (1 << 14) /* Bit 14: Receive Interrupt Enable */
#define USIC_CCR_AIEN               (1 << 15) /* Bit 15: Alternative Receive Interrupt Enable */
#define USIC_CCR_BRGIEN             (1 << 16) /* Bit 16: Baud Rate Generator Interrupt Enable */

/* Capture Mode Timer Register */

#define USIC_CMTR_CTV_SHIFT         (0)      /* Bits 0-9: Captured Timer Value */
#define USIC_CMTR_CTV_MASK          (0x3ff << USIC_CMTR_CTV_SHIFT)

/* Protocol Status Register */

#define USIC_PSR_ST(n)              (1 << (n))/* Bit n:  Protocol Status Flag n */
#define USIC_PSR_ST0                (1 << 0)  /* Bit 0:  Protocol Status Flag 0 */
#define USIC_PSR_ST1                (1 << 1)  /* Bit 1:  Protocol Status Flag 1 */
#define USIC_PSR_ST2                (1 << 2)  /* Bit 2:  Protocol Status Flag 2 */
#define USIC_PSR_ST3                (1 << 3)  /* Bit 3:  Protocol Status Flag 3 */
#define USIC_PSR_ST4                (1 << 4)  /* Bit 4:  Protocol Status Flag 4 */
#define USIC_PSR_ST5                (1 << 5)  /* Bit 5:  Protocol Status Flag 5 */
#define USIC_PSR_ST6                (1 << 6)  /* Bit 6:  Protocol Status Flag 6 */
#define USIC_PSR_ST7                (1 << 7)  /* Bit 7:  Protocol Status Flag 7 */
#define USIC_PSR_ST8                (1 << 8)  /* Bit 8:  Protocol Status Flag 8 */
#define USIC_PSR_ST9                (1 << 9)  /* Bit 9:  Protocol Status Flag 9 */
#define USIC_PSR_RSIF               (1 << 10) /* Bit 10: Receiver Start Indication Flag */
#define USIC_PSR_DLIF               (1 << 11) /* Bit 11: Data Lost Indication Flag */
#define USIC_PSR_TSIF               (1 << 12) /* Bit 12: Transmit Shift Indication Flag */
#define USIC_PSR_TBIF               (1 << 13) /* Bit 13: Transmit Buffer Indication Flag */
#define USIC_PSR_RIF                (1 << 14) /* Bit 14: Receive Indication Fla */
#define USIC_PSR_AIF                (1 << 15) /* Bit 15: Alternative Receive Indication Flag */
#define USIC_PSR_BRGIF              (1 << 16) /* Bit 16: Baud Rate Generator Indication Fl */

