apache/nuttx/arch/arm/src/xmc4/chip/xmc4_usic.h
#define USIC_PSR_ASCMODE_TXIDLE     (1 << 0)  /* Bit 0:  Transmission Idle */
#define USIC_PSR_ASCMODE_RXIDLE     (1 << 1)  /* Bit 1:  Reception Idle */
#define USIC_PSR_ASCMODE_SBD        (1 << 2)  /* Bit 2:  Synchronization Break Detected */
#define USIC_PSR_ASCMODE_COL        (1 << 3)  /* Bit 3:  Collision Detected */
#define USIC_PSR_ASCMODE_RNS        (1 << 4)  /* Bit 4:  Receiver Noise Detected */
#define USIC_PSR_ASCMODE_FER0       (1 << 5)  /* Bit 5:  Format Error in Stop Bit 0 */
#define USIC_PSR_ASCMODE_FER1       (1 << 6)  /* Bit 6:  Format Error in Stop Bit 1 */
#define USIC_PSR_ASCMODE_RFF        (1 << 7)  /* Bit 7:  Receive Frame Finished */
#define USIC_PSR_ASCMODE_TFF        (1 << 8)  /* Bit 8:  Transmitter Frame Finished */
#define USIC_PSR_ASCMODE_BUSY       (1 << 9)  /* Bit 9:  Transfer Status BUSY */
#define USIC_PSR_ASCMODE_RSIF       (1 << 10) /* Bit 10: Receiver Start Indication Flag */
#define USIC_PSR_ASCMODE_DLIF       (1 << 11) /* Bit 11: Data Lost Indication Flag */
#define USIC_PSR_ASCMODE_TSIF       (1 << 12) /* Bit 12: Transmit Shift Indication Flag */
#define USIC_PSR_ASCMODE_TBIF       (1 << 13) /* Bit 13: Transmit Buffer Indication Flag */
#define USIC_PSR_ASCMODE_RIF        (1 << 14) /* Bit 14: Receive Indication Flag */
#define USIC_PSR_ASCMODE_AIF        (1 << 15) /* Bit 15: Alternative Receive Indication Flag */
#define USIC_PSR_ASCMODE_BRGIF      (1 << 16) /* Bit 16: Baud Rate Generator Indication Flag */

#define USIC_PSR_SSCMODE_MSLS       (1 << 0)  /* Bit 0:  MSLS Status */
#define USIC_PSR_SSCMODE_DX2S       (1 << 1)  /* Bit 1:  DX2S Status */
#define USIC_PSR_SSCMODE_MSLSEV     (1 << 2)  /* Bit 2:  MSLS Event Detected */
#define USIC_PSR_SSCMODE_DX2TEV     (1 << 3)  /* Bit 3:  DX2T Event Detected */
#define USIC_PSR_SSCMODE_PARERR     (1 << 4)  /* Bit 4:  Parity Error Event Detected */
#define USIC_PSR_SSCMODE_RSIF       (1 << 10) /* Bit 10: Receiver Start Indication Flag */
#define USIC_PSR_SSCMODE_DLIF       (1 << 11) /* Bit 11: Data Lost Indication Flag */
#define USIC_PSR_SSCMODE_TSIF       (1 << 12) /* Bit 12: Transmit Shift Indication Flag */
#define USIC_PSR_SSCMODE_TBIF       (1 << 13) /* Bit 13: Transmit Buffer Indication Flag */
#define USIC_PSR_SSCMODE_RIF        (1 << 14) /* Bit 14: Receive Indication Flag */
#define USIC_PSR_SSCMODE_AIF        (1 << 15) /* Bit 15: Alternative Receive Indication Flag */
#define USIC_PSR_SSCMODE_BRGIF      (1 << 16) /* Bit 16: Baud Rate Generator Indication Flag */

#define USIC_PSR_IICMODE_SLSEL      (1 << 0)  /* Bit 0:  Slave Select */
#define USIC_PSR_IICMODE_WTDF       (1 << 1)  /* Bit 1:  Wrong TDF Code Found */
#define USIC_PSR_IICMODE_SCR        (1 << 2)  /* Bit 2:  Start Condition Received */
#define USIC_PSR_IICMODE_RSCR       (1 << 3)  /* Bit 3:  Repeated Start Condition Received */
#define USIC_PSR_IICMODE_PCR        (1 << 4)  /* Bit 4:  Stop Condition Received */
#define USIC_PSR_IICMODE_NACK       (1 << 5)  /* Bit 5:  Non-Acknowledge Received */
#define USIC_PSR_IICMODE_ARL        (1 << 6)  /* Bit 6:  Arbitration Lost */
#define USIC_PSR_IICMODE_SRR        (1 << 7)  /* Bit 7:  Slave Read Request */
#define USIC_PSR_IICMODE_ERR        (1 << 8)  /* Bit 8:  Error */
#define USIC_PSR_IICMODE_ACK        (1 << 9)  /* Bit 9:  Acknowledge Received */
#define USIC_PSR_IICMODE_RSIF       (1 << 10) /* Bit 10: Receiver Start Indication Flag */
#define USIC_PSR_IICMODE_DLIF       (1 << 11) /* Bit 11: Data Lost Indication Flag */
#define USIC_PSR_IICMODE_TSIF       (1 << 12) /* Bit 12: Transmit Shift Indication Flag */
#define USIC_PSR_IICMODE_TBIF       (1 << 13) /* Bit 13: Transmit Buffer Indication Flag */
#define USIC_PSR_IICMODE_RIF        (1 << 14) /* Bit 14: Receive Indication Flag */
#define USIC_PSR_IICMODE_AIF        (1 << 15) /* Bit 15: Alternative Receive Indication Flag */
#define USIC_PSR_IICMODE_BRGIF      (1 << 16) /* Bit 16: Baud Rate Generator Indication Flag */

#define USIC_PSR_IISMODE_WA         (1 << 0)  /* Bit 0:  Word Address */
#define USIC_PSR_IISMODE_DX2S       (1 << 1)  /* Bit 1:  DX2S Sta */
#define USIC_PSR_IISMODE_DX2TEV     (1 << 3)  /* Bit 3:  DX2T Event Detected */
#define USIC_PSR_IISMODE_WAFE       (1 << 4)  /* Bit 4:  WA Falling Edge Event */
#define USIC_PSR_IISMODE_WARE       (1 << 5)  /* Bit 5:  WA Rising Edge Event */
#define USIC_PSR_IISMODE_END        (1 << 6)  /* Bit 6:  WA Generation End */
#define USIC_PSR_IISMODE_RSIF       (1 << 10) /* Bit 10: Receiver Start Indication Flag */
#define USIC_PSR_IISMODE_DLIF       (1 << 11) /* Bit 11: Data Lost Indication Flag */
#define USIC_PSR_IISMODE_TSIF       (1 << 12) /* Bit 12: Transmit Shift Indication Flag */
#define USIC_PSR_IISMODE_TBIF       (1 << 13) /* Bit 13: Transmit Buffer Indication Flag */
#define USIC_PSR_IISMODE_RIF        (1 << 14) /* Bit 14: Receive Indication Flag */
#define USIC_PSR_IISMODE_AIF        (1 << 15) /* Bit 15: Alternative Receive Indication Flag */
#define USIC_PSR_IISMODE_BRGIF      (1 << 16) /* Bit 16: Baud Rate Generator Indication Flag */

/* Protocol Status Clear Register */

#define USIC_PSCR_CST(n)            (1 << (n))/* Bit n:  Clear Status Flag n in PSR */
#define USIC_PSCR_CST0              (1 << 0)  /* Bit 0:  Clear Status Flag 0 in PSR */
#define USIC_PSCR_CST1              (1 << 1)  /* Bit 1:  Clear Status Flag 1 in PSR */
#define USIC_PSCR_CST2              (1 << 2)  /* Bit 2:  Clear Status Flag 2 in PSR */
#define USIC_PSCR_CST3              (1 << 3)  /* Bit 3:  Clear Status Flag 3 in PSR */
#define USIC_PSCR_CST4              (1 << 4)  /* Bit 4:  Clear Status Flag 4 in PSR */
#define USIC_PSCR_CST5              (1 << 5)  /* Bit 5:  Clear Status Flag 5 in PSR */
#define USIC_PSCR_CST6              (1 << 6)  /* Bit 6:  Clear Status Flag 6 in PSR */
#define USIC_PSCR_CST7              (1 << 7)  /* Bit 7:  Clear Status Flag 7 in PSR */
#define USIC_PSCR_CST8              (1 << 8)  /* Bit 8:  Clear Status Flag 8 in PSR */
#define USIC_PSCR_CST9              (1 << 9)  /* Bit 9:  Clear Status Flag 9 in PSR */
#define USIC_PSCR_CRSIF             (1 << 10) /* Bit 10: Clear Receiver Start Indication Flag */
#define USIC_PSCR_CDLIF             (1 << 11) /* Bit 11: Clear Data Lost Indication Flag */
#define USIC_PSCR_CTSIF             (1 << 12) /* Bit 12: Clear Transmit Shift Indication Flag */
#define USIC_PSCR_CTBIF             (1 << 13) /* Bit 13: Clear Transmit Buffer Indication Flag */
#define USIC_PSCR_CRIF              (1 << 14) /* Bit 14: Clear Receive Indication Flag */
#define USIC_PSCR_CAIF              (1 << 15) /* Bit 15: Clear Alternative Receive Indication Flag */
#define USIC_PSCR_CBRGIF            (1 << 16) /* Bit 16: Clear Baud Rate Generator Indication Flag */

/* Receiver Buffer Status Register */

#define USIC_RBUFSR_WLEN_SHIFT      (0)       /* Bits 0-3: Received Data Word Length in RBUF or RBUFD */
#define USIC_RBUFSR_WLEN_MASK       (15 << USIC_RBUFSR_WLEN_SHIFT)
#define USIC_RBUFSR_SOF             (1 << 6)  /* Bit 6:  Start of Frame in RBUF or RBUFD */
#define USIC_RBUFSR_PAR             (1 << 8)  /* Bit 8:  Protocol-Related Argument in RBUF or RBUFD */
#define USIC_RBUFSR_PERR            (1 << 9)  /* Bit 9:  Protocol-related Error in RBUF or RBUFD */
#define USIC_RBUFSR_RDV0            (1 << 13) /* Bit 13: Receive Data Valid in RBUF or RBUFD */
#define USIC_RBUFSR_RDV1            (1 << 14) /* Bit 14: Receive Data Valid in RBUF or RBUFD */
#define USIC_RBUFSR_DS              (1 << 15) /* Bit 15: Data Source of RBUF or RBUFD */

/* Receiver Buffer Register */

#define USIC_RBUF_DSR_SHIFT         (0)       /* Bits 0-15: Received Data */
#define USIC_RBUF_DSR_MASK          (0xffff << USIC_RBUF_DSR_SHIFT)

/* Receiver Buffer Register for Debugger */

#define USIC_RBUFD_DSR_SHIFT        (0)       /* Bits 0-15: Data from Shift Register */
#define USIC_RBUFD_DSR_MASK         (0xffff << USIC_RBUFD_DSR_SHIFT)

/* Receiver Buffer Register 0 */

#define USIC_RBUF0_DSR0_SHIFT       (0)       /* Bits 0-15: Data of Shift Registers 0[3:0] */
#define USIC_RBUF0_DSR0_MASK        (0xffff << USIC_RBUF0_DSR0_SHIFT)

