apache/nuttx/arch/arm/src/xmc4/chip/xmc4_usic.h
/* Receiver Buffer Register 1 */

#define USIC_RBUF1_DSR1_SHIFT       (0)       /* Bits 0-15: Data of Shift Registers 1[3:0] */
#define USIC_RBUF1_DSR1_MASK        (0xffff << USIC_RBUF1_DSR1_SHIFT)

/*  Receiver Buffer 01 Status Register */

#define USIC_RBUF01SR_WLEN0_SHIFT   (0)       /* Bits 0-3: Received Data Word Length in RBUF0 */
#define USIC_RBUF01SR_WLEN0_MASK    (15 << USIC_RBUF01SR_WLEN0_SHIFT)
#define USIC_RBUF01SR_SOF0          (1 << 6)  /* Bit 6:  Start of Frame in RBUF0 */
#define USIC_RBUF01SR_PAR0          (1 << 8)  /* Bit 8:  Protocol-Related Argument in RBUF0 */
#define USIC_RBUF01SR_PERR0         (1 << 9)  /* Bit 9:  Protocol-related Error in RBUF0 */
#define USIC_RBUF01SR_RDV00         (1 << 13) /* Bit 13: Receive Data Valid in RBUF0 */
#define USIC_RBUF01SR_RDV01         (1 << 14) /* Bit 14: Receive Data Valid in RBUF1 */
#define USIC_RBUF01SR_DS0           (1 << 15) /* Bit 15: Data Source */
#define USIC_RBUF01SR_WLEN1_SHIFT   (16)      /* Bits 16-19: Received Data Word Length in RBUF1 */
#define USIC_RBUF01SR_WLEN1_MASK    (15 << USIC_RBUF01SR_WLEN1_SHIFT)
#define USIC_RBUF01SR_SOF1          (1 << 22) /* Bit 22: Start of Frame in RBUF1 */
#define USIC_RBUF01SR_PAR1          (1 << 24) /* Bit 24: Protocol-Related Argument in RBUF1 */
#define USIC_RBUF01SR_PERR1         (1 << 25) /* Bit 25: Protocol-related Error in RBU */
#define USIC_RBUF01SR_RDV10         (1 << 29) /* Bit 29: Receive Data Valid in RBUF0 */
#define USIC_RBUF01SR_RDV11         (1 << 30) /* Bit 30: Receive Data Valid in RBUF1 */
#define USIC_RBUF01SR_DS1           (1 << 31) /* Bit 31: Data Source */

/* Flag Modification Register */

#define USIC_FMR_MTDV_SHIFT         (0)       /* Bits 0-1: Modify Transmit Data Valid */
#define USIC_FMR_MTDV_MASK          (3 << USIC_FMR_MTDV_SHIFT)
#  define USIC_FMR_MTDV_NOACTION    (0 << USIC_FMR_MTDV_SHIFT) /* No action */
#  define USIC_FMR_MTDV_TDV         (1 << USIC_FMR_MTDV_SHIFT) /* Bit TDV is set, TE is unchanged */
#  define USIC_FMR_MTDV_TDVTE       (2 << USIC_FMR_MTDV_SHIFT) /* Bits TDV and TE are cleared */
#define USIC_FMR_ATVC               (1 << 4)  /* Bit 4:  Activate Bit TVC */
#define USIC_FMR_CRDV0              (1 << 14) /* Bit 14: Clear Bits RDV for RBUF0 */
#define USIC_FMR_CRDV1              (1 << 15) /* Bit 15: Clear Bit RDV for RBUF1 */
#define USIC_FMR_SIO0               (1 << 16) /* Bit 16: Set Interrupt Output SR0 */
#define USIC_FMR_SIO1               (1 << 17) /* Bit 17: Set Interrupt Output SR1 */
#define USIC_FMR_SIO2               (1 << 18) /* Bit 18: Set Interrupt Output SR2 */
#define USIC_FMR_SIO3               (1 << 19) /* Bit 19: Set Interrupt Output SR3 */
#define USIC_FMR_SIO4               (1 << 20) /* Bit 20: Set Interrupt Output SR4 */
#define USIC_FMR_SIO5               (1 << 21) /* Bit 21: Set Interrupt Output SR5 */

/* Transmit Buffer (32 x 4-bytes) */

#define USIC_TBUF_TDATA_SHIFT       (0)       /* Bits 0-15: Transmit Data */
#define USIC_TBUF_TDATA_MASK        (0xffff << USIC_TBUF_TDATA_SHIFT)

/* USIC FIFO Registers */

/* Bypass Data Register */

#define USIC_BYP_BDATA_SHIFT        (0)       /* Bits 0-15: Bypass Data */
#define USIC_BYP_BDATA_MASK         (0xffff << USIC_BYP_BDATA_SHIFT)

/* Bypass Control Register */

#define USIC_BYPCR_BWLE_SHIFT       (0)       /* Bits 0-3: Bypass Word Length */
#define USIC_BYPCR_BWLE_MASK        (15 << USIC_BYPCR_BWLE_SHIFT)
  #define USIC_BYPCR_BWLE(n)        ((uint32_t)((n)-1) << USIC_BYPCR_BWLE_SHIFT)
#define USIC_BYPCR_BDSSM            (1 << 8)  /* Bit 8:  Bypass Data Single Shot Mode */
#define USIC_BYPCR_BDEN_SHIFT       (10)      /* Bits 10-11: Bypass Data Enable */
#define USIC_BYPCR_BDEN_MASK        (3 << USIC_BYPCR_BDEN_SHIFT)
#  define USIC_BYPCR_BDEN_DISABLE   (0 << USIC_BYPCR_BDEN_SHIFT) /* Transfer of bypass data is disabled */
#  define USIC_BYPCR_BDEN_ENABLED   (1 << USIC_BYPCR_BDEN_SHIFT) /* Transfer of bypass data to TBUF if BDV = 1 */
#  define USIC_BYPCR_BDEN_GATED0    (2 << USIC_BYPCR_BDEN_SHIFT) /* Bypass data transferred if BDV = 1 and DX2S = 0 */
#  define USIC_BYPCR_BDEN_GATED1    (3 << USIC_BYPCR_BDEN_SHIFT) /* Bypass data transferred if BDV = 1 and DX2S = 1 */
#define USIC_BYPCR_BDVTR            (1 << 12) /* Bit 12: Bypass Data Valid Trigger */
#define USIC_BYPCR_BPRIO            (1 << 13) /* Bit 13: Bypass Priority */
#define USIC_BYPCR_BDV              (1 << 15) /* Bit 15: Bypass Data Valid */
#define USIC_BYPCR_BSELO_SHIFT      (16)      /* Bits 16-20: Bypass Select Outputs */
#define USIC_BYPCR_BSELO_MASK       (31 << USIC_BYPCR_BSELO_SHIFT)
#  define USIC_BYPCR_BSELO(n)       ((uint32_t)(n) << USIC_BYPCR_BSELO_SHIFT)
#define USIC_BYPCR_BHPC_SHIFT       (21)      /* Bits 21-23: Bypass Hardware Port Control */
#define USIC_BYPCR_BHPC_MASK        (7 << USIC_BYPCR_BHPC_SHIFT)
#  define USIC_BYPCR_BHPC(n)        ((uint32_t)(n) << USIC_BYPCR_BHPC_SHIFT)

/* Transmitter Buffer Control Register */

#define USIC_TBCTR_DPTR_SHIFT       (0)       /* Bits 0-1: Data Pointer */
#define USIC_TBCTR_DPTR_MASK        (3 << USIC_TBCTR_DPTR_SHIFT)
#  define USIC_TBCTR_DPTR(n)        ((uint32_t)(n) << USIC_TBCTR_DPTR_SHIFT)
#define USIC_TBCTR_LIMIT_SHIFT      (8)       /* Bits 8-13: Limit For Interrupt Generation */
#define USIC_TBCTR_LIMIT_MASK       (0x3f << USIC_TBCTR_LIMIT_SHIFT)
#  define USIC_TBCTR_LIMIT(n)       ((uint32_t)(n) << USIC_TBCTR_LIMIT_SHIFT)
#define USIC_TBCTR_STBTM            (1 << 14) /* Bit 14: Standard Transmit Buffer Trigger Mode */
#define USIC_TBCTR_STBTEN           (1 << 15) /* Bit 15: Standard Transmit Buffer Trigger Enable */
#define USIC_TBCTR_STBINP_SHIFT     (16)      /* Bits 16-18: Standard Transmit Buffer Interrupt Node Pointer */
#define USIC_TBCTR_STBINP_MASK      (7 << USIC_TBCTR_STBINP_SHIFT)
#  define USIC_TBCTR_STBINP_SR0     (0 << USIC_TBCTR_STBINP_SHIFT) /* Output SR0 becomes activated */
#  define USIC_TBCTR_STBINP_SR1     (1 << USIC_TBCTR_STBINP_SHIFT) /* Output SR1 becomes activated */
#  define USIC_TBCTR_STBINP_SR2     (2 << USIC_TBCTR_STBINP_SHIFT) /* Output SR2 becomes activated */
#  define USIC_TBCTR_STBINP_SR3     (3 << USIC_TBCTR_STBINP_SHIFT) /* Output SR3 becomes activated */
#  define USIC_TBCTR_STBINP_SR4     (4 << USIC_TBCTR_STBINP_SHIFT) /* Output SR4 becomes activated */
#  define USIC_TBCTR_STBINP_SR5     (5 << USIC_TBCTR_STBINP_SHIFT) /* Output SR5 becomes activated */
#define USIC_TBCTR_ATBINP_SHIFT     (19)      /* Bits 19-21: Alternative Transmit Buffer Interrupt Node Pointer */
#define USIC_TBCTR_ATBINP_MASK      (7 << USIC_TBCTR_ATBINP_SHIFT)
#  define USIC_TBCTR_ATBINP_SR0     (0 << USIC_TBCTR_ATBINP_SHIFT) /* Output SR0 becomes activated */
#  define USIC_TBCTR_ATBINP_SR1     (1 << USIC_TBCTR_ATBINP_SHIFT) /* Output SR1 becomes activated */
#  define USIC_TBCTR_ATBINP_SR2     (2 << USIC_TBCTR_ATBINP_SHIFT) /* Output SR2 becomes activated */
#  define USIC_TBCTR_ATBINP_SR3     (3 << USIC_TBCTR_ATBINP_SHIFT) /* Output SR3 becomes activated */
#  define USIC_TBCTR_ATBINP_SR4     (4 << USIC_TBCTR_ATBINP_SHIFT) /* Output SR4 becomes activated */
#  define USIC_TBCTR_ATBINP_SR5     (5 << USIC_TBCTR_ATBINP_SHIFT) /* Output SR5 becomes activated */
#define USIC_TBCTR_SIZE_SHIFT       (24)      /* Bits 24-26: Buffer Size */
#define USIC_TBCTR_SIZE_MASK        (7 << USIC_TBCTR_SIZE_SHIFT)
#  define USIC_TBCTR_SIZE_DISABLE   (0 << USIC_TBCTR_SIZE_SHIFT) /* FIFO mechanism is disabled */
#  define USIC_TBCTR_SIZE_2         (1 << USIC_TBCTR_SIZE_SHIFT) /* FIFO buffer contains 2 entries */
#  define USIC_TBCTR_SIZE_4         (2 << USIC_TBCTR_SIZE_SHIFT) /* FIFO buffer contains 4 entries */
#  define USIC_TBCTR_SIZE_8         (3 << USIC_TBCTR_SIZE_SHIFT) /* FIFO buffer contains 8 entries */
#  define USIC_TBCTR_SIZE_16        (4 << USIC_TBCTR_SIZE_SHIFT) /* FIFO buffer contains 16 entries */
#  define USIC_TBCTR_SIZE_32        (5 << USIC_TBCTR_SIZE_SHIFT) /* FIFO buffer contains 32 entries */
#  define USIC_TBCTR_SIZE_64        (6 << USIC_TBCTR_SIZE_SHIFT) /* FIFO buffer contains 64 entries */
#define USIC_TBCTR_LOF              (1 << 28) /* Bit 28: Buffer Event on Limit Overflow */
#define USIC_TBCTR_STBIEN           (1 << 30) /* Bit 30: Standard Transmit Buffer Interrupt Enable */
#define USIC_TBCTR_TBERIEN          (1 << 31) /* Bit 31: Transmit Buffer Error Interrupt Enable */

/* Receiver Buffer Control Register */

#define USIC_RBCTR_DPTR_SHIFT       (0)       /* Bits 0-5: Data Pointer */
#define USIC_RBCTR_DPTR_MASK        (0x3f << USIC_RBCTR_DPTR_SHIFT)
#  define USIC_RBCTR_DPTR(n)        ((uint32_t)(n) << USIC_RBCTR_DPTR_SHIFT)
#define USIC_RBCTR_LIMIT_SHIFT      (8)       /* Bits 8-13: Limit For Interrupt Generation */
#define USIC_RBCTR_LIMIT_MASK       (0x3f << USIC_RBCTR_LIMIT_SHIFT)
#  define USIC_RBCTR_LIMIT(n)       ((uint32_t)(n) << USIC_RBCTR_LIMIT_SHIFT)
#define USIC_RBCTR_SRBTM            (1 << 14) /* Bit 14: Standard Receive Buffer Trigger Mode */
#define USIC_RBCTR_SRBTEN           (1 << 15) /* Bit 15: Standard Receive Buffer Trigger Enable */
#define USIC_RBCTR_SRBINP_SHIFT     (16)      /* Bits 16-18: Standard Receive Buffer Interrupt Node Pointer */
#define USIC_RBCTR_SRBINP_MASK      (7 << USIC_RBCTR_SRBINP_SHIFT)
#  define USIC_RBCTR_SRBINP_SR0     (0 << USIC_RBCTR_SRBINP_SHIFT) /* Output SR0 becomes activated */
#  define USIC_RBCTR_SRBINP_SR1     (1 << USIC_RBCTR_SRBINP_SHIFT) /* Output SR1 becomes activated */
#  define USIC_RBCTR_SRBINP_SR2     (2 << USIC_RBCTR_SRBINP_SHIFT) /* Output SR2 becomes activated */
#  define USIC_RBCTR_SRBINP_SR3     (3 << USIC_RBCTR_SRBINP_SHIFT) /* Output SR3 becomes activated */
#  define USIC_RBCTR_SRBINP_SR4     (4 << USIC_RBCTR_SRBINP_SHIFT) /* Output SR4 becomes activated */
#  define USIC_RBCTR_SRBINP_SR5     (5 << USIC_RBCTR_SRBINP_SHIFT) /* Output SR5 becomes activated */
#define USIC_RBCTR_ARBINP_SHIFT     (19)      /* Bits 19-21: Alternative Receive Buffer Interrupt Node Pointer */
#define USIC_RBCTR_ARBINP_MASK      (7 << USIC_RBCTR_ARBINP_SHIFT)
#  define USIC_RBCTR_ARBINP_SR0     (0 << USIC_RBCTR_ARBINP_SHIFT) /* Output SR0 becomes activated */
#  define USIC_RBCTR_ARBINP_SR1     (1 << USIC_RBCTR_ARBINP_SHIFT) /* Output SR1 becomes activated */
#  define USIC_RBCTR_ARBINP_SR2     (2 << USIC_RBCTR_ARBINP_SHIFT) /* Output SR2 becomes activated */
#  define USIC_RBCTR_ARBINP_SR3     (3 << USIC_RBCTR_ARBINP_SHIFT) /* Output SR3 becomes activated */
#  define USIC_RBCTR_ARBINP_SR4     (4 << USIC_RBCTR_ARBINP_SHIFT) /* Output SR4 becomes activated */
#  define USIC_RBCTR_ARBINP_SR5     (5 << USIC_RBCTR_ARBINP_SHIFT) /* Output SR5 becomes activated */
#define USIC_RBCTR_RCIM_SHIFT       (22)      /* Bits 22-23: Receiver Control Information Mode */
#define USIC_RBCTR_RCIM_MASK        (3 << USIC_RBCTR_RCIM_SHIFT)
#  define USIC_RBCTR_RCIM_MODE0     (0 << USIC_RBCTR_RCIM_SHIFT) /* RCI[4] = PERR, RCI[3:0] = WLEN */
#  define USIC_RBCTR_RCIM_MODE1     (1 << USIC_RBCTR_RCIM_SHIFT) /* RCI[4] = SOF, RCI[3:0] = WLEN */
#  define USIC_RBCTR_RCIM_MODE2     (2 << USIC_RBCTR_RCIM_SHIFT) /* RCI[4] = 0, RCI[3:0] = WLEN */
#  define USIC_RBCTR_RCIM_MODE3     (3 << USIC_RBCTR_RCIM_SHIFT) /* RCI[4] = PERR, RCI[3] = PAR,
                                                                  * RCI[2:1] = 0, RCI[0] = SOF */
#define USIC_RBCTR_SIZE_SHIFT       (24)      /* Bits 24-26: Buffer Size */
#define USIC_RBCTR_SIZE_MASK        (7 << USIC_RBCTR_SIZE_SHIFT)
#  define USIC_RBCTR_SIZE_DISABLE   (0 << USIC_RBCTR_SIZE_SHIFT) /* FIFO mechanism is disabled */
#  define USIC_RBCTR_SIZE_2         (1 << USIC_RBCTR_SIZE_SHIFT) /* FIFO buffer contains 2 entries */
#  define USIC_RBCTR_SIZE_4         (2 << USIC_RBCTR_SIZE_SHIFT) /* FIFO buffer contains 4 entries */
#  define USIC_RBCTR_SIZE_8         (3 << USIC_RBCTR_SIZE_SHIFT) /* FIFO buffer contains 8 entries */
#  define USIC_RBCTR_SIZE_16        (4 << USIC_RBCTR_SIZE_SHIFT) /* FIFO buffer contains 16 entries */
#  define USIC_RBCTR_SIZE_32        (5 << USIC_RBCTR_SIZE_SHIFT) /* FIFO buffer contains 32 entries */
#  define USIC_RBCTR_SIZE_64        (6 << USIC_RBCTR_SIZE_SHIFT) /* FIFO buffer contains 64 entries */
#define USIC_RBCTR_RNM              (1 << 27) /* Bit 27: Receiver Notification Mode */
#define USIC_RBCTR_LOF              (1 << 28) /* Bit 28: Buffer Event on Limit Overflow */
#define USIC_RBCTR_ARBIEN           (1 << 29) /* Bit 29: Alternative Receive Buffer Interrupt Enable */
#define USIC_RBCTR_SRBIEN           (1 << 30) /* Bit 30: Standard Receive Buffer Interrupt Enable */
#define USIC_RBCTR_RBERIEN          (1 << 31) /* Bit 31: Receive Buffer Error Interrupt Enable */

/* Transmit/Receive Buffer Pointer Register */

#define USIC_TRBPTR_TDIPTR_SHIFT    (0)       /* Bits 0-5: Transmitter Data Input Pointer */
#define USIC_TRBPTR_TDIPTR_MASK     (0x3f << USIC_TRBPTR_TDIPTR_SHIFT)
#define USIC_TRBPTR_TDOPTR_SHIFT    (8)       /* Bits 8-13: Transmitter Data Output Pointer */
#define USIC_TRBPTR_TDOPTR_MASK     (0x3f << USIC_TRBPTR_TDOPTR_SHIFT)
#define USIC_TRBPTR_RDIPTR_SHIFT    (16)      /* Bits 16-21: Receiver Data Input Pointer */
#define USIC_TRBPTR_RDIPTR_MASK     (0x3f << USIC_TRBPTR_RDIPTR_SHIFT)
#define USIC_TRBPTR_RDOPTR_SHIFT    (24)      /* Bits 24-29: Receiver Data Output Pointer */
#define USIC_TRBPTR_RDOPTR_MASK     (0x3f << USIC_TRBPTR_RDOPTR_SHIFT)

/* Transmit/Receive Buffer Status Register */

#define USIC_TRBSR_SRBI             (1 << 0)  /* Bit 0:  Standard Receive Buffer Event */
#define USIC_TRBSR_RBERI            (1 << 1)  /* Bit 1:  Receive Buffer Error Event */
#define USIC_TRBSR_ARBI             (1 << 2)  /* Bit 2:  Alternative Receive Buffer Event */
#define USIC_TRBSR_REMPTY           (1 << 3)  /* Bit 3:  Receive Buffer Empty */
#define USIC_TRBSR_RFULL            (1 << 4)  /* Bit 4:  Receive Buffer Full */
#define USIC_TRBSR_RBUS             (1 << 5)  /* Bit 5:  Receive Buffer Busy */
#define USIC_TRBSR_SRBT             (1 << 6)  /* Bit 6:  Standard Receive Buffer Event Trigger */
#define USIC_TRBSR_STBI             (1 << 8)  /* Bit 8:  Standard Transmit Buffer Event */
#define USIC_TRBSR_TBERI            (1 << 9)  /* Bit 9:  Transmit Buffer Error Event */
#define USIC_TRBSR_TEMPTY           (1 << 11) /* Bit 11: Transmit Buffer Empty */
#define USIC_TRBSR_TFULL            (1 << 12) /* Bit 12: Transmit Buffer Full */
#define USIC_TRBSR_TBUS             (1 << 13) /* Bit 13: Transmit Buffer Busy */
#define USIC_TRBSR_STBT             (1 << 14) /* Bit 14: Standard Transmit Buffer Event Trigger */
#define USIC_TRBSR_RBFLVL_SHIFT     (16)      /* Bits 16-22: Receive Buffer Filling Level */
#define USIC_TRBSR_RBFLVL_MASK      (0x7f << USIC_TRBSR_RBFLVL_SHIFT)
#  define USIC_TRBSR_RBFLVL(n)      ((uint32_t)(n) << USIC_TRBSR_RBFLVL_SHIFT)
#define USIC_TRBSR_TBFLVL_SHIFT     (24)      /* Bits 22-28: Transmit Buffer Filling Level */
#define USIC_TRBSR_TBFLVL_MASK      (0x7f << USIC_TRBSR_TBFLVL_SHIFT)
#  define USIC_TRBSR_TBFLVL(n)      ((uint32_t)(n) << USIC_TRBSR_TBFLVL_SHIFT)

/* Transmit/Receive Buffer Status Clear Register */

