apache/nuttx/arch/arm/src/xmc4/chip/xmc4_usic.h
#define USIC_TRBSCR_CSRBI           (1 << 0)  /* Bit 0:  Clear Standard Receive Buffer Event */
#define USIC_TRBSCR_CRBERI          (1 << 1)  /* Bit 1:  Clear Receive Buffer Error Event */
#define USIC_TRBSCR_CARBI           (1 << 2)  /* Bit 2:  Clear Alternative Receive Buffer Event */
#define USIC_TRBSCR_CSTBI           (1 << 8)  /* Bit 8:  Clear Standard Transmit Buffer Event */
#define USIC_TRBSCR_CTBERI          (1 << 9)  /* Bit 9:  Clear Transmit Buffer Error Event */
#define USIC_TRBSCR_CBDV            (1 << 10) /* Bit 10: Clear Bypass Data Valid */
#define USIC_TRBSCR_FLUSHRB         (1 << 14) /* Bit 14: Flush Receive Buffer */
#define USIC_TRBSCR_FLUSHTB         (1 << 15) /* Bit 15: Flush Transmit Buffer */

/* Receiver Buffer Output Register */

#define USIC_OUTR_DSR_SHIFT         (0)       /* Bits 0-15: Received Data */
#define USIC_OUTR_DSR_MASK          (0xffff << USIC_OUTR_DSR_SHIFT)
#define USIC_OUTR_RCI_SHIFT         (16)      /* Bits 16-20: Receiver Control Information */
#define USIC_OUTR_RCI_MASK          (31 << USIC_OUTR_RCI_SHIFT)

/* Receiver Buffer Output Register L for Debugger */

#define USIC_OUTDR_DSR_SHIFT        (0)       /* Bits 0-15: Data from Shift Register */
#define USIC_OUTDR_DSR_MASK         (0xffff << USIC_OUTDR_DSR_SHIFT)
#define USIC_OUTDR_RCI_SHIFT        (16)      /* Bits 16-30: Receive Control Information from Shift Register */
#define USIC_OUTDR_RCI_MASK         (31 << USIC_OUTDR_RCI_SHIFT)

/* Transmit FIFO Buffer (32 x 4-bytes) */

#define USIC_IN_TDATA_SHIFT         (0)      /* Bits 0-15: Transmit Data */
#define USIC_IN_TDATA_MASK          (0xffff << USIC_IN_TDATA_SHIFT)

#endif /* __ARCH_ARM_SRC_XMC4_CHIP_XMC4_USIC_H */
